var chhomeworkgive = {
	'2022-09-01': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-02': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-05': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-09-06': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-07': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-08': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-09': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-12': {
		'uklen': 'останній слайд у презентації||Знайди відповідне слово, утвори речення, запиши.|1. Димовий, димний, димучий, димчастий (порох, труба, камінь, вулкан).|2. Діловий, діловитий (людина, розмова).',
		'zarlit': 'дочитати казку до кінця||детально переказати||сторінка 27 відповісти на питання 1-4',
		'eng': '',
		'mat': '',
		'mus': ''
	},
	'2022-09-13': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-14': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-15': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-16': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-19': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-09-20': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-21': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-22': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-23': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-26': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-09-27': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-28': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-29': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-30': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-03': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-04': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-05': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-06': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-07': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-10': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-11': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-12': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-13': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-14': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-17': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-18': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-19': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-20': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-21': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-24': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-25': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-26': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-27': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-28': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },
};