var chhomeworkgive = {
	'2022-09-01': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-02': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-05': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-09-06': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-07': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-08': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-09': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-12': {
		'uklen': 'Знайди відповідне слово, утвори речення, запиши (останній слайд у презентації).|1. Димовий, димний, димучий, димчастий (порох, труба, камінь, вулкан).|2. Діловий, діловитий (людина, розмова).',
		'zarlit': '1. Дочитати казку до кінця|2. Детально переказати|3. Відповісти на питання 1-4 з сторінки 27',
		'eng': '1. Пригадати слова (a pen, a pencil, a ruler, a pencilcase, a rubber, a book, ...)|2. Скласти 12 словосполучень зі словами :this, that these, those  та зі словами ( a pen, a pencil...)|Example:|This copy-book|these bags|that ruler,|those vocabularies',
		'mat': 'З нового підручника|1. №56(1,3,5)|2. №64(1,3,5) ',
		'mus': '1. Пергелянути і прочитати матеріали до укроку за посиланням.|2. В зошиті записати конспект.|3. Прослухати музичні композиції за посиланням.'
	},
	'2022-09-13': {
		'eng': '1. Переглянути презентацію(знайти помилки в домашніх завданнях(вміти пояснити)|2. Доробити вправу з останнього слайду;|3. Ппр.3 ст.11 (електронний підручник) дивитись підказку на ст.137 (табличка Be)',
		'hist': '',
		'mat': '',
		'nat': '',
		'uklit': '',
		'fiz': ''
	},
	'2022-09-14': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-15': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-16': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-19': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-09-20': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-21': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-22': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-23': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-09-26': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-09-27': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-09-28': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-09-29': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-09-30': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-03': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-04': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-05': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-06': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-07': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-10': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-11': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-12': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-13': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-14': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-17': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-18': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-19': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-20': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-21': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },

	'2022-10-24': { 'uklen': '', 'zarlit': '', 'eng': '', 'mat': '', 'mus': '' },
	'2022-10-25': { 'eng': '', 'hist': '', 'mat': '', 'nat': '', 'uklit': '', 'fiz': '' },
	'2022-10-26': { 'fiz': '', 'pain': '', 'prog': '', 'uklen': '', 'dram': '', 'mat': '' },
	'2022-10-27': { 'fiz': '', 'nat': '', 'mat': '', 'uklen': '', 'zarlit': '', 'eng': '', 'oz': '' },
	'2022-10-28': { 'mat': '', 'tec': '', 'hist': '', 'uklit': '', 'eng': '' },
};