//Перелік уроків
var chLesson = {

	'uklen': {
		'lesson': 'Українська мова',
		'teacher': 'Волк Світлана Віталіївна',
		'classroom': 'https://classroom.google.com/c/NTQ1MjMyODExMjEy',
		'homework': '',
		'meet': 'https://meet.google.com/qte-iqxy-dcs',
		'booklink': '',
		'book': ''
	},
	'uklit': {
		'lesson': 'Українська література',
		'teacher': 'Волк Світлана Віталіївна',
		'classroom': 'https://classroom.google.com/c/NTQ1MjMzNDAzMDE0',
		'homework': '',
		'meet': 'https://meet.google.com/zrm-ipgh-oxb',
		'booklink': '',
		'book': ''
	},
	'zarlit': {
		'lesson': 'Зарубіжна література',
		'teacher': 'Солодка Ірина Петрівна',
		'classroom': 'https://classroom.google.com/c/NTQ0NzUwODYxNzA1',
		'homework': '',
		'meet': 'https://meet.google.com/try-xbxe-eax',
		'booklink': '',
		'book': ''
	},
	'eng': {
		'lesson': 'Англійська мова',
		'teacher': 'Задоянчук Оксана Василівна',
		'classroom': 'https://classroom.google.com/c/NTQ1NTY3Mjk4ODQ5',
		'homework': '',
		'meet': 'https://meet.google.com/zvd-crbk-vgb',
		'booklink': '',
		'book': ''
	},
	'mat': {
		'lesson': 'Математика',
		'teacher': 'Карабаджак Ірина Анатоліївна',
		'classroom': 'https://classroom.google.com/c/NTg5NDAyNzYyNDM5',
		'homework': '',
		'meet': 'https://meet.google.com/hek-ofcw-uou',
		'booklink': '',
		'book': ''
	},
	'mus': {
		'lesson': 'Музичне мистецтво',
		'teacher': 'Кериченко Наталія Миколаївна',
		'classroom': 'https://classroom.google.com/c/NTI2OTIxMzY1NjM3',
		'homework': '',
		'meet': 'https://meet.google.com/nfa-usas-xei',
		'booklink': '',
		'book': ''
	},
	'hist': {
		'lesson': 'Історія',
		'teacher': 'Дідур Оксана Володимирівна',
		'classroom': 'https://classroom.google.com/c/NTQ0NzkyOTQ2MTgw',
		'homework': '',
		'meet': 'https://meet.google.com/iqw-yvqg-fbh',
		'booklink': '',
		'book': ''
	},
	'etika': {
		'lesson': 'Етика',
		'teacher': 'Дідур Оксана Володимирівна',
		'classroom': 'https://classroom.google.com/c/NTg1MzQ5ODM1ODQ4',
		'homework': '',
		'meet': 'https://meet.google.com/uob-rwtu-xgf',
		'booklink': '',
		'book': ''
	},
	'fiz': {
		'lesson': 'Фізична культура',
		'teacher': 'Стеблюк Олександра Вікторівна',
		'classroom': 'https://classroom.google.com/c/NTI3MjA4NzU0NjU1',
		'homework': '',
		'meet': 'https://meet.google.com/jbg-aaqq-nbo',
		'booklink': '',
		'book': ''
	},
	'pain': {
		'lesson': 'Образотворче мистецтво',
		'teacher': 'Шклярук Світлана Олександрівна',
		'classroom': 'https://classroom.google.com/c/NjI0NTgxNzQ1ODc0',
		'homework': '',
		'meet': 'https://meet.google.com/ftc-frif-bph',
		'booklink': '',
		'book': ''
	},
	'prog': {
		'lesson': 'Інформатика',
		'teacher': 'Литвинюк Тетяна Ігорівна',//'Шевчук Андрій Григорович',
		'classroom': 'https://classroom.google.com/c/NjUxMjkyMjA1ODgy',
		'homework': '',
		'meet': 'https://meet.google.com/utt-pwfc-wzk',
		'booklink': 'https://pidruchnyk.com.ua/2685-informatyka-6-klas-morze-2023.html',
		'book': ''
	},
	'dram': {
		'lesson': 'Драматургія і театр',
		'teacher': 'Рахнянська Наталія Федорівна',
		'classroom': 'https://classroom.google.com/c/NTI3MTI3NTg1MjMx',
		'homework': '',
		'meet': 'meet.google.com/ref-iyhu-bzk',
		'booklink': '',
		'book': ''
	},
	'oz': {
		'lesson': 'Основи здоров\'я',
		'teacher': 'Щепанська Алла Борисівна',
		'classroom': 'https://classroom.google.com/c/NTQ1MDE1NTYzNDM2',
		'homework': '',
		'meet': 'https://meet.google.com/uzn-bwwf-zti',
		'booklink': '',
		'book': 'https://pidruchnyk.com.ua/2644-zdorovia-6-klas-vorontsova-2023.html'
	},
	'tec': {
		'lesson': 'Технологія',
		'teacher': 'Іванова Алла Опанасівна',
		'classroom': 'https://classroom.google.com/c/NTQ1NTc3MDc3MTYz',
		'homework': '',
		'meet': '',
		'booklink': '',
		'book': ''
	},
	'nat': {
		'lesson': 'Пізнаємо природу',
		'teacher': 'Касяненко Світлана Володимирівна',
		'classroom': 'https://classroom.google.com/c/NTQ1MDc1MDgxMzg1',
		'homework': '',
		'meet': '',
		'booklink': '',
		'book': ''
	},
	'geog': {
		'lesson': 'Географія',
		'teacher': 'Шитова Тетяна Василівна',
		'classroom': 'https://classroom.google.com/c/NjU4MjUzNzIwOTY2',
		'homework': '',
		'meet': 'https://meet.google.com/pek-tivp-svp',
		'booklink': 'https://shkola.in.ua/2833-heohrafiia-6-klas-kobernik-2023.html',
		'book': ''
	}
};

//Розклад уроків - на тиждень

//2023
//var arSсhedule = [
//	['etika', 'zarlit', 'uklen', 'nat', 'dram', 'fiz'],
//	['pain', 'geog', 'uklen', 'hist', 'mat', 'eng', 'fiz'],
//	['mus', 'mat', 'hist', 'eng', 'fiz', 'uklit', 'uklit'],
//	['oz', 'zarlit', 'prog', 'mat', 'uklen', 'geog'],
//	['uklen', 'mat', 'mat', 'eng', 'nat', 'tec', 'tec']
//
//];

//2024
var arSсhedule = [
	['fiz', 'prog', 'eng', 'nat', 'uklen', 'uklen'],
	['pain', 'geog', 'uklen', 'hist', 'mat', 'eng', 'fiz'],
	['mus', 'mat', 'hist', 'eng', 'fiz', 'uklit', 'uklit'],
	['oz', 'zarlit', 'prog', 'mat', 'dram', 'geog'],
	['uklen', 'mat', 'mat', 'eng', 'nat', 'tec', 'tec']
];


//Розклад дзвінків

//2023
var arTime = ['08:30', '09:25', '10:20', '11:15', '12:20', '13:20', '14:15', '15:15'];

//Дні тижня
var arWeek = ['Понеділок', 'Вівторок', 'Середа', 'Четверг', 'П\'ятниця'];

// Дати попередніх уроків
var chLessonDate = {
	'uklen': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'uklit': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'zarlit': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'eng': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'mat': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'mus': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'hist': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'etika': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'fiz': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'pain': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'prog': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'dram': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'oz': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'tec': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'nat': { 'chDate': { 'count': 0 }, 'arI': [0] },
	'geog': { 'chDate': { 'count': 0 }, 'arI': [0] }
};

//Домашні завдання - по дням їх видачі
var chHomework = {

	'2023-09-04': {
		'etika': '||1. Заповнити таблицю за виданими листочками',
		'zarlit': '||1. Стор.9 Завдання № 11 (намалювати або описати)',
		'uklen': '||1. Впр. 9 (доробити)|2. Виписати 2 прислівя про мову або слово',
		'nat': '||1. Стор. 12, параг. 1,2, запитання, завдання, дослідження',
		'dram': '||1. Сцена з будьякого епізоду з вистави - намалювати або описати письмово',
		'fiz': '||1. Форма'
	},
	'2023-09-05': {
		'pain': '||1. Альбом, фарби, пензлі|2. Нитки 50 см трьох кольорів',
		'geog': '||1. Виписати позначки хмарності і малохмарності',
		'uklen': '||1. Впр. 25 (доробити)',
		'hist': '||1. Записати дві задачі з історії',
		'mat': '||1. №9 (3, 4)',
		'eng': '||1. P. 8, ex 1,2,3 ',
		'fiz': '||1. Форма'
	},
	'2023-09-06': {
		'mus': '||1.!!!',
		'mat': '||1. №23 (1,4)',
		'hist': '||1. Написати 2-і задачі: 1 в одній ері, 2 між двома ерами',
		'eng': '||1. Написати дні народження членів сімї',
		'fiz': '||1. Форма',
		'uklit': '||1. Читати "Сокіл-Род"|2. Скласти 6 тестових питань'
	},
	'2023-09-07': {
		'oz': '||1. !!!',
		'zarlit': '||1. Стор. 11 Записати групи міфів|2. Стор. 11-13 читати ',
		'prog': '||1.!!!',
		'mat': '||1. №28',
		'uklen': '||1. Впр. 29',
		'geog': '||1. Параг 2, стор.14 намалювати позначки хмарності та опадів'
	},
	'2023-09-08': {
		'uklen': '||1.!!!',
		'mat': '||1. №26, №41(4) ',
		'mat': '||1. ',
		'eng': '||1. Стор.10 впр.4',
		'nat': '||1. Написати 2 прислівя про причинно наслідковий звязок',
		'tec': '||1.!!!',
		'tec': '||1. '
	},

	'2023-09-11': {
		'etika': '||1.!!!',
		'zarlit': '||1. Стор.21-22 прочитати.|2. Стор. 22 від 7 до 10 питання усно',
		'uklen': '||1. Впр. 37',
		'nat': '||1. Стор. 19-22 читати, завд. №1 (письмово)',
		'dram': '||1.!!!',
		'fiz': '||1. Форма'
	},
	'2023-09-12': {
		'pain': '||1. !!!',
		'geog': '||1. Написати твір-есе на одну з поданих тем "Як знання про Землю вплинулина (обрання місця та форми відпочинку влітку/ підготовку одягу та взуття напередодні навчання в школі/планування поїздки/ін)"',
		'uklen': '||1. Впр.39, 42(закінчити)',
		'hist': '||1. Параг. 6',
		'mat': '||1. №59(2,4), №67(3)',
		'eng': '||1. P. 11 ex.5',
		'fiz': '||1. Форма'
	},
	'2023-09-13': {
		'mus': '||1.!!!',
		'mat': '||1. №86(1,2), №73(3,5)',
		'hist': '||1. Параг. 7,8',
		'eng': '||1. P.12, ex.2,3',
		'fiz': '||1. Форма',
		'uklit': '||1.!!!'
	},
	'2023-09-14': {
		'oz': '||1. !!!',
		'zarlit': '||1. Порівняти характеристики Зевса і Прометея',
		'prog': '||1. !!!',
		'mat': '||1. Стор, 13,14, № 1-4, 6, 7, 12',
		'uklen': '||1. Впр.44 (зробити схеми ті що скраю)',
		'geog': '||1. !!!'
	},
	'2023-09-15': {
		'uklen': '||1. ',
		'mat': '||1. №93(1,2,4) №97(уточнити)',
		'mat': '||1. ',
		'eng': '||1. P.13, ex.3',
		'nat': '||1. Параг. 4 стор.22 завд.2,4',
		'tec': '||1. ',
		'tec': '||1. '
	},

	'2023-09-18': {
		'etika': '||1.!!!',
		'zarlit': '||1. Стор 25-27 (читати)',
		'uklen': '||1. Впр. 56',
		'nat': '||1. Стор. 30 завд. 3',
		'dram': '||1. !!!',
		'fiz': '||1. Форма'
	},
	'2023-09-19': {
		'pain': '||1. Пластилін',
		'geog': '||1. !!! (вчительку замінили)',
		'uklen': '||1. Впр. 60',
		'hist': '||1. Повторити словник',
		'mat': '||1. №113, №122',
		'eng': '||1. P.15, ex 2,3',
		'fiz': '||1. Форма'
	},
	'2023-09-20': {
		'mus': '||1. Вивчити пісню (за виданим листочком)',
		'mat': '||1. №146',
		'hist': '||1. Параг. 13-14, стор.62 завд.3',
		'eng': '||1. P.16 ex. 1,2',
		'fiz': '||1. Форма',
		'uklit': '||1. Стор. 25-26, вивчити колядку|2. Стор. 27-28, вивчити щедрівку',
		'uklit': '||1. '
	},
	'2023-09-21': {
		'oz': '||1. Створити план евакуації квартири і позначити бепечні точки',
		'zarlit': '||1. Стор. 34 QR-код',
		'prog': '||1. !!!',
		'mat': '||1. №159',
		'uklen': '||1. Впр.69',
		'geog': '||1. Пермалювати з атласу стор.30,31 у контурну карту стор.12,13|2. Завдання за посиланням'
	},
	'2023-09-22': {
		'uklen': '||1. ',
		'mat': '||1. 176, 180',
		'mat': '||1. ',
		'eng': '||1. Написати твір про свій день',
		'nat': '||1. Параг.6',
		'tec': '||1. Доробити к/р',
		'tec': '||1. '
	},

	'2023-09-25': {
		'etika': '||1. Закінчити байку "Три бика та лев"(письмово)',
		'zarlit': '||1. Стор. 32, завд.6(письмово)|2.Стор. 33 завд.13-15 (усно)',
		'uklen': '||1. Впр. 82',
		'nat': '||1. Параг.6 завд.4 (письмово)',
		'dram': '||1.!!!',
		'fiz': '||1. Форма'
	},
	'2023-09-26': {
		'pain': '||1. Все малювання фарбами',
		'geog': '||1. Парагр.8 законспектувати|2. Доробити табличку в зошиті для контрольних',
		'uklen': '||1. Впр.88',
		'hist': '||1. Параг.11, 12',
		'mat': '||1. №187(1-3), №185(1,2)',
		'eng': '||1. Повторити словник',
		'fiz': '||1. Форма'
	},
	'2023-09-27': {
		'mus': '||1. !!!',
		'mat': '||1. №194, №192',
		'hist': '||1. !!!Практична',
		'eng': '||1. Написати повідомлення про українського паролімпійця',
		'fiz': '||1. Форма',
		'uklit': '||1. Написати тест з 6 запитань',
		'uklit': '||1. '
	},
	'2023-09-28': {
		'oz': '||1. !!!',
		'zarlit': '||1. Запитати 6 тестових запитанб на тему "Давньогрецькі міфи"',
		'prog': '||1. !!!',
		'mat': '||1. № 220(5-7)',
		'uklen': '||1. Впр. 93 (доробити)|2. Повторити правила на стор. 48-49',
		'geog': '||1. Параг.8 стор 141 завд.7'
	},
	'2023-09-29': {
		'uklen': '||1. !!!',
		'mat': '||1. !!!',
		'mat': '||1. ',
		'eng': '||1. P.18, ex.6, CD-23, ',
		'nat': '||1. Параг.7, стор. 34, завд. 2',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-10-02': {
		'etika': '||1. Дати відповідь на 9 запитань з презентації',
		'zarlit': '||1. Сор. 35-36',
		'uklen': '||1. Впр. 101',
		'nat': '||1. Параг.7',
		'dram': '||1. !!!',
		'fiz': '||1. Форма'
	},
	'2023-10-03': {
		'pain': '||1. Фарби',
		'geog': '||1. Параг. 10,11, стор.50 ',
		'uklen': '||1. Впр.106',
		'hist': '||1. !!!Практична',
		'mat': '||1. №247 (1-4), №251(1-4)',
		'eng': '||1. P.20,21 ex.6,7',
		'fiz': '||1. Форма'
	},
	'2023-10-04': {
		'mus': '||1. Вивчити пісню',
		'mat': '||1. №260',
		'hist': '||1. !!!К/р',
		'eng': '||1. P.10, ex.2,3 (WB)',
		'fiz': '||1. Форма',
		'uklit': '||1. 1 варіант - написати характеристику "Бджолі"',
		'uklit': '||1. 2 варіант - написати характеристику "Шершня"'
	},
	'2023-10-05': {
		'oz': '||1.!!!',
		'zarlit': '||1. Стор.41-49',
		'prog': '||1.!!!',
		'mat': '||1. №278',
		'uklen': '||1. Впр.115',
		'geog': '||1. Параг.10, задача'
	},
	'2023-10-06': {
		'uklen': '||1. !!!',
		'mat': '||1. №289(4,5), №292(1) або №300(4,5), №302(1)',
		'mat': '||1. ',
		'eng': '||1. P.142. ex.180 (підручник вчителя)',
		'nat': '||1. Параг.8, стор. 37 відповісти на питання, №3 письмово, №2 (по бажанню)',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-10-09': {
		'etika': 'https://classroom.google.com/w/NTg1MzQ5ODM1ODQ4/t/all||1. Виконати тест у зошиті',
		'zarlit': '||1. Стор 52-56 читати',
		'uklen': '||1. Стор. 57 QR-код підгот. до к/р ',
		'nat': '||1. Параг.9, завд. 3, 4',
		'dram': '||1. !!!',
		'fiz': '||1. Форма'
	},
	'2023-10-10': {
		'pain': '||1. !!!',
		'geog': '||1. Параг. 12 намалювати план кімнати',
		'uklen': '||1. !!!К/р',
		'hist': '||1. Параг. 16',
		'mat': '||1. №317',
		'eng': '||1. P.17 ex. 2,3 (WB)',
		'fiz': '||1. Форма'
	},
	'2023-10-11': {
		'mus': '||1. !!!',
		'mat': '||1. №323(2,3)',
		'hist': '||1. Парагр.16 (конспект у зошиті)',
		'eng': '||1. P.22 ex.2 (read)',
		'fiz': '||1. Форма',
		'uklit': '||1. Байка "Лелека і голуб" (вивчити на пам\'ять)',
		'uklit': '||1. '
	},
	'2023-10-12': {
		'oz': '||1. !!!',
		'zarlit': '||1. Стор. 61-65, написати 4 питання по змісту',
		'prog': '||1. ',
		'mat': '||1. №12',
		'uklen': '||1. !!!Ярмарок',
		'geog': '||1. Параг.9(старий підручник)|2. стор.58 №3,4 (новий підручник)'
	},
	'2023-10-13': {
		'uklen': '||1. Впр. 129',
		'mat': '||1. !!!К/р',
		'mat': '||1. ',
		'eng': '||1. P.23, ex.1',
		'nat': '||1. Стор.40-41 п.4 від парграфа',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-10-16': {
		'etika': '||1. Повторити словник. Виконати завдання у зошиті',
		'zarlit': '||1. Стор. 68-69, питання 1-3 (усно)',
		'uklen': '||1. Впр. 139, 140',
		'nat': '||1. Стор. 45. завд. 2',
		'dram': '||1. !!!',
		'fiz': '||1. Форма'
	},
	'2023-10-17': {
		'pain': '||1. !!!',
		'geog': '||1. Стор.59. параг.12 читати|2. Стор.62 завд. з розділу "Первіряємо інформацію" - виконати, тема "Практична робота №3. Визначення напрямків на плані, абсолютної та відносної висоти точок, азимуту вказаних на плані обє\'ктів. Орієнтування за планом на місцевості"',
		'uklen': '||1. !!!К/р',
		'hist': '||1. Параг. 12',
		'mat': '||1. №349(1-4)',
		'eng': '||1. P.23 ex.3',
		'fiz': '||1. Форма'
	},
	'2023-10-18': {
		'mus': '||1. Розучування "Руді листи" https://www.youtube.com/watch?v=Xtvm5fXNCkk&ab_channel=%D0%93%D0%B5%D0%BD%D0%BD%D0%B0%D0%B4%D1%96%D0%B9%D0%A1%D0%B0%D0%BB%D0%BE%D0%B3%D1%83%D0%B1',
		'mat': '||1. №354(3,4,5,7)',
		'hist': '||1. Стор. 136-137',
		'eng': '||1. P.24 ex.5|2. P.18, ex.1-3 (WB)',
		'fiz': '||1. Форма',
		'uklit': '||1. Вивчити гімн',
		'uklit': '||1. '
	},
	'2023-10-19': {
		'oz': '||1. Стор. 38-43, параг. 7Е (електроний підручник)|2. Стор. 44 підготуватись до діагностичної роботи',
		'zarlit': '||1. Стор.72-80 читати',
		'prog': '||1. Стор.31 законспектувати означення.|2. Стор. 57. перейти за посиланням коду та виконати завдання|3 Стор.57-60 читати',
		'mat': '||1. 359 (1-3)',
		'uklen': '||1. !!!К/р',
		'geog': '||1. Стор. 60 завдання. Визначити: 1) абсолютну висоту пагорба; 2) абсолютну глибину улоговини; 3)відносну висоту пагорба у порівнянні з дном улоговини; 4) відносну висоту вершини у порівнянні з точкою 1; 5) відносну глибину улоговини'
	},
	'2023-10-20': {
		'uklen': '||1. !!!',
		'mat': '||1. !!!',
		'mat': '||1. ',
		'eng': '||1. P.21, ex.1-4(WB)|2. P.25, ex.4(письмово, читати діалог)',
		'nat': '||1. Параг.11|2. Стор. 49 завд.2,3 письмово',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-10-23': { 'etika': '||1. ', 'zarlit': '||1. ', 'uklen': '||1. ', 'nat': '||1. ', 'dram': '||1. ', 'fiz': '||1. Форма' },
	'2023-10-24': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2023-10-25': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2023-10-26': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'uklen': '||1. ', 'geog': '||1. ' },
	'2023-10-27': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },

	'2023-10-30': {
		'etika': '||1. ',
		'zarlit': '||1. Стор.81-87. Читати Завдання 1,2 (усно)',
		'uklen': '||1. ',
		'nat': '||1. Стор. 52, параг. 12, завд.4',
		'dram': '||1. ',
		'fiz': '||1. Форма'
	},
	'2023-10-31': {
		'pain': '||1.!!!',
		'geog': '||1. Параг. 13 (нова книжка) параг.14,15(стара книжка)|2. Стор 69. завдання о.с.д. ',
		'uklen': '||1. Правила чергування впр.159',
		'hist': '||1. Стор. 94-95',
		'mat': '||1. !!!',
		'eng': '||1. P.26 ex.2',
		'fiz': '||1. Форма'
	},
	'2023-11-01': {
		'mus': '||1. !!!Олімпіада',
		'mat': '||1. №421(1,3,5), №425(1,5)',
		'hist': '||1. Дописати репортаж',
		'eng': '||1 P.124 unit 4',
		'fiz': '||1. Форма',
		'uklit': '||1. Вивчити "І досі сниться"',
		'uklit': '||1. '
	},
	'2023-11-02': {
		'oz': '||1. !!!',
		'zarlit': '||1. Стор. 88-89, стор. 89 QR-код',
		'prog': '||1. Стор.63 законспектувати у зошиті означення|2 Стор. 65. впр. 1',
		'mat': '||1. №439 (8,9,10), №443(1,2)',
		'uklen': '||1. Стор. 83 підготуватись до К/р',
		'geog': '||1. Параг.16(старий підручник), параг.14 стор.69-72 о.с.д'
	},
	'2023-11-03': {
		'uklen': '||1. !!!К/р',
		'mat': '||1. !!!',
		'mat': '||1. ',
		'eng': '||1. P.27 describe the events',
		'nat': '||1. Нові знання (немає запису)',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-11-06': {
		'etika': '||1. Прослухати пісня Фагота та Івана Шерельва "Про соціум"|2. Сенкан до слова: родина/школа/клас/Україна',
		'zarlit': '||1. Намалювати або описати майбутнє Різдво Скруджа',
		'uklen': '||1. Стор. 88 впр. 177',
		'nat': '||1. Підготуватись до к/р параг 1-13',
		'dram': '||1 !!!',
		'fiz': '||1. Форма'
	},
	'2023-11-07': {
		'pain': '||1. !!!',
		'geog': '||1. Параг.15, стор.76 №3,5(новий підручник) або Параг. 17, стор.68 завд.2.3(старий підручник)',
		'uklen': '||1. Впр. 181',
		'hist': '||1. Стор.85-86, (класрум)',
		'mat': '||1. № 493',
		'eng': '||1. P. 28 "life skils" read and remember',
		'fiz': '||1. Форма'
	},
	'2023-11-08': {
		'mus': '||1. !!!',
		'mat': '||1. №501',
		'hist': '||1. Стор.88-89',
		'eng': '||1. P.28, ex.5',
		'fiz': '||1. Форма',
		'uklit': '||1. !!! Тривога',
		'uklit': '||1. '
	},
	'2023-11-09': {
		'oz': '||1. !!!',
		'zarlit': '||1. Стор. 94-98 знати зміст',
		'prog': '||1. Стор. 73 законспектувати означення. |2. Стор. 74 впр.2',
		'mat': '||1. №522(1), №525(2)',
		'uklen': '||1. Впр. 187',
		'geog': '||1. Підг. К/р'
	},
	'2023-11-10': {
		'uklen': '||1. Впр.194',
		'mat': '||1. !!! Тривога',
		'mat': '||1. ',
		'eng': '||1. !!! Тривога',
		'nat': '||1. !!! Тривога',
		'tec': '||1. !!! Тривога',
		'tec': '||1. '
	},

	'2023-11-13': {
		'etika': '||1. Написати види поведінки людини',
		'zarlit': '||1. Стор. 103-109',
		'uklen': '||1. Впр 202',
		'nat': '||1. Параг. 14, завд.4',
		'dram': '||1. !!!',
		'fiz': '||1. Форма'
	},
	'2023-11-14': {
		'pain': '||1. !!!',
		'geog': '||1. Підготувати додаткову інформацію на тему відомі мореплавці, дослідники',
		'uklen': '||1. Словниковий диктант 15 слів',
		'hist': '||1. Стор.90 к.р.',
		'mat': '||1. Стор. 111 №6 або 9',
		'eng': '||1. P.32 ex.3',
		'fiz': '||1. Форма'
	},
	'2023-11-15': {
		'mus': '||1. !!!',
		'mat': '||1. К/р',
		'hist': '||1. Презентація в к.р.',
		'eng': '||1. P.24 ex.1-5 (WB)',
		'fiz': '||1. Форма',
		'uklit': '||1. Тривога!!!',
		'uklit': '||1.'
	},
	'2023-11-16': {
		'oz': '||1. !!!',
		'zarlit': '||1. Записати 6 запитань до тексту "Ніч перде різдвом"',
		'prog': '||1. Стор. 77 переглянути відео за посиланням та виписати ключові фрази|2. Стор.81 завд.12',
		'mat': '||1. №562 (3,4), №564(4,5)',
		'uklen': '||1. Впр. 215 (написати текст за темою)',
		'geog': '||1. Стор.81. парг.16 читати|2. Стор.73 завд.7 (старий підручник)'
	},
	'2023-11-17': {
		'uklen': '||1. !!!К/диктант',
		'mat': '||1. №583(1), №585(2)',
		'mat': '||1. ',
		'eng': '||1. P.34 ex.3',
		'nat': '||1. Параг.15|2. Стор.65 завд.1,2',
		'tec': '||1. ',
		'tec': '||1. '
	},

	'2023-11-20': {
		'etika': 'https://classroom.google.com/c/NTg1MzQ5ODM1ODQ4/a/NjQxNjI1NTI4MTUy/details||1. Виконайте завдання: 6 клас Конфлікти',
		'zarlit': '||1. Стор. 112-113 скласти 4 запитання',
		'uklen': '||1. Словниковий диктант (18 слів)',
		'nat': '||1. Параг. 15 (повторити)',
		'dram': '||1. !!!',
		'fiz': '||1. Форма'
	},
	'2023-11-21': {
		'pain': '||1. !!!',
		'geog': '||1. Параг.17 позначити літосферні плити на контурній карті',
		'uklen': '||1. Впр. 223',
		'hist': '||1. Законспектувати винаходи держав давнього сходу',
		'mat': '||1. № 593',
		'eng': '||1. P. 35 ex. 2',
		'fiz': '||1. Форма'
	},
	'2023-11-22': {
		'mus': '||1. !!!',
		'mat': '||1. №614, №611',
		'hist': '||1. ',
		'eng': '||1. P.36 ex.2 (виписати дієслова у минулому часі)',
		'fiz': '||1. Форма',
		'uklit': '||1. Прочитати твір "Ялинка"',
		'uklit': '||1. '
	},
	'2023-11-23': {
		'oz': '||1. Стор. 56-62, проаналізувати упаковку будь-якого продукту. Знайти на ній необхідні відомості',
		'zarlit': '||1. Стор. 117-120 прочитати підготувати перказ близько за текстом',
		'prog': '||1. Стор. 83 Перглянути відео за посиланням та виписати ключові фрази.|2. Стор.83 завд.6',
		'mat': '||1. !!!',
		'uklen': '||1. Впр.235',
		'geog': '||1. Стор. 91 параг.18|2. Стор.94 завд. 5,6'
	},
	'2023-11-24': {
		'uklen': '||1. !!!',
		'mat': '||1. №642(3), №652 або №652, №659',
		'mat': '||1. ',
		'eng': '||1. P.37 ex.4,5 Gr.',
		'nat': '||1. Параг. 15 повторити',
		'tec': '||1. ',
		'tec': '||1. '
	},

	'2023-11-27': {
		'etika': '||1. Повторити словник до теми уроку. Виконати завдання у зошиті',
		'zarlit': '||1. Стор. 125-134 опрацювати матеріал підручника. Усно відповісти на запитання до розділу',
		'uklen': '||1. Стор.93-123 підготувати теорію до К/р',
		'nat': '||1. Параг.17 опрацювати, завд. 1',
		'dram': '||1. Тема: "Психологія людини - різні типи характерів і моделі поведінки, - чи буває неправильна поведінка" і від чого вона залежить, - як приймати позитивних/негативних персонажів і чого вони мають навчити, - засвоєння досвіду через спостереження за іншими людьми/персонажами у виставі',
		'fiz': '||1. Форма'
	},
	'2023-11-28': {
		'pain': '||1. Дібрати матеріал на вибір, альбом, олівець графітний. Тема "Характер театральних образів. Створення ескізу костюма для артистів балету"',
		'geog': '||1. Стор. 96, параг. 19 Позначити на контурній карті вулкани суходолу (Везувій, Етна, Крккатау, Ключевська Сопка) та зазначити їх назви',
		'uklen': '||1. ',
		'hist': '||1. Підготуватись до К/р по темі уроку узагальнення та коррекції знань Розділу 2 "Людина і суспільство Давнього Сходу" (комбінована робота)',
		'mat': '||1. №663',
		'eng': '||1. P.38 ex.1 (read) 2. Ex. 2,1 p.38 (write)',
		'fiz': '||1. Форма'
	},
	'2023-11-29': {
		'mus': '||1. !!!',
		'mat': '||1. №682',
		'hist': '||1. Параг 16-25 підготовка до К/р',
		'eng': '||1. Повторити матеріал попердніх уроків',
		'fiz': '||1. Форма',
		'uklit': '||1. Написати 6 запитань до твору М.Коцюбинського "Ялинка"',
		'uklit': '||1. '
	},
	'2023-11-30': {
		'oz': '||1. Стор. 63-67 параг. 11(електроний підручник) проаналізуквати які дії виконуєте правильно, а які - ні',
		'zarlit': '||1. ',
		'prog': '||1. Стор. 90-91 законспектувати означення|2. Стор. 97-98 за розділом Вивчаємо законспектувати ключові фрази|3. Стор.96 завд.4 з розділу Працюємо самостійно',
		'mat': 'https://classroom.google.com/c/NTg5NDAyNzYyNDM5/m/NjQzMzI0MzY3NTU0/details||1. Завдання підготовки до к.р. №4',
		'uklen': '||1. Впр. 243',
		'geog': '||1. Стор. 100, параг. 20 читати.|2. Стор.102, завд.1-3'
	},
	'2023-12-01': {
		'uklen': '||1. Впр.',
		'mat': '||1. !!!',
		'mat': '||1. ',
		'eng': '||1. Стор.40 впр.2(читати), 4(письмово). Тема:"Робота вихідного дня. Активізація тематичної лексики. Вправи з аудіювання"',
		'nat': '||1. Параг. 17, стор.79 завд 9 (письмово) ',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-12-04': {
		'etika': '||1. Повторити основні поняття до теми. Виконати завдання у класрумі. Тема: "Доброчинність (благодійність), волонтерство"',
		'zarlit': '||1. ',
		'uklen': '||1. Впр. 264',
		'nat': '||1. Стор. 76-77 опрацювати',
		'dram': '||1. Тема: "Вибір теми/літературного твору і відповідної форми(театр ляльок, естрада мюзкл, драмтеатр, фізичний театр тощо) для втілення на сцені усвідомлений вибір (знанн, досвід), приорітети ресурси (реалізація задля реалізації ідеї)"',
		'fiz': '||1. Форма'
	},
	'2023-12-05': {
		'pain': '||1. Дібрати пензлі,а кварель, воду, серветки, альбом. Перглянути уривки з мультфільму "Козаки. Футбол. Епізод №26. Фінляндія.". Тема:"Жанри в українській мультиплікації. Малюнок улюбленого персонажа різдвяного мультфільму"',
		'geog': '||1. Стор. 106 параг. 21 читати. Вміти чітко давати визначення новим термінам та назвам: морена, баранячі лоби, фігурні скелі, бархан, дюна, вивітрювання',
		'uklen': '||1. Впр.275',
		'hist': '||1. К/р!!!',
		'mat': '||1. №703',
		'eng': '||1. Стор. 41, впр. 7, Тема: Робота вихідного дня. Склади оголошення про пошук роботи',
		'fiz': '||1. Форма'
	},
	'2023-12-06': {
		'mus': '||1. Розучування "Sajfie party". Тема: "Жанри в Українській мультиплікації"',
		'mat': '||1. №709',
		'hist': '||1. Параг. 27',
		'eng': '||1. Написати 6-8 речень про мій день',
		'fiz': '||1. Форма',
		'uklit': '||1. !!!Тривога(подивитись у Нових знаннях)',
		'uklit': '||1. '
	},
	'2023-12-07': {
		'oz': '||1. Стор. 68-74, параг. 12 (електронний підручник)|2. Стор.74 оцінити свої досягнення|3. Параг. 8-12 повторити і підготуватись до діагностичної роботи',
		'zarlit': '||1. ст. 146-155 читати',
		'prog': '||1. Стор. 97, завд.11 за розділом (оцініюємо себе)|2. Стор. 95-99 опрацювати і виписати основні твердження',
		'mat': '||1. №728, №730',
		'uklen': '||1. Впр. 281 ',
		'geog': '||1. Стор. 109, параг. 22. Стор.114 запитання №5 дати письмову відповідь'
	},
	'2023-12-08': {
		'uklit': '||1. Дочитати твір "Єва і білосніжна квітка лілії"',
		'mat': '||1. №766',
		'mat': '||1. ',
		'eng': '||1. Стор.32 впр.1-3 (в/б)',
		'nat': '||1. Параг. 18, завд.1 (письмово)',
		'tec': '||1. ',
		'tec': '||1. '
	},

	'2023-12-11': {
		'etika': '||1. Повторити матеріал розділ, підготуватись до к/р. Тема діагностична к/р з розділу 3,4 "Світ людських взаємин. Моральні відносини у суспільтві" Тестова робота|2. Параг.9-15 підготовка до к/р',
		'zarlit': '||1. Дочитати твір "Жага до життя"',
		'uklen': '||1. Впр. 290',
		'nat': '||1. Параг.14-19 підготовка до к/р ',
		'dram': '||1. Тема: Реалізація тетрального проекту. Практична робота',
		'fiz': '||1. Форма'
	},
	'2023-12-12': {
		'pain': '||1 Дібрати акварель, маркери, альбом, пензлі, воду, альбом. Тема "Жанри українського кіномистецтва для дітей. Створення афіш до дитячого кінофільму за фільмом Казка старого мельника." Урок узагальнений',
		'geog': '||1. Параг.23? стор. 114  виконати завдання розділу проект для краєзнавця',
		'uklen': '||1. Впр. 301',
		'hist': '||1. Дописати практичну',
		'mat': '||1. №794(4), 796(4), 803',
		'eng': '||1. !!!К/р',
		'fiz': '||1. Форма'
	},
	'2023-12-13': {
		'mus': '||1. !!!',
		'mat': '||1. №823(2), 833',
		'hist': '||Параг. 39 завд.2 стор.185. Тема "Практична робота Памятки історії античної греції, кімерійців, скіфів та сарматів у музеях мого краю, України, Європи, світу"|1. Греція зображення (грецької культури)|2. Кимірійці, скіфи, сармати (зображення архітекткри, вбрання) на вибір',
		'eng': '||1. !!!',
		'fiz': '||1. Форма',
		'uklit': '||1. Стор. 82-124 прочитати (піготовка до к/р)',
		'uklit': '||1. '
	},
	'2023-12-14': {
		'oz': '||1. Тема Розвиток підлітка',
		'zarlit': '||1. Підготуватися до к/р виконати тестові завдання за посиланням на стор. 166',
		'prog': '||1. Стор. 105 законспектувати означення|2. Стор. 107 виконати завдання 5 за розділом Оцінююємо себе. Тема "Інструктаж з БЖД Публікація інформації в мережі інтерне. Колоажі, комікси. Створення колажів і коміксів в онлайн середовищі"',
		'mat': '||1. !!! Тривога',
		'uklen': '||1. Підготуватись до к/р за темою іменник',
		'geog': '||1. Стор. 118 параг.24 читати Робота з картою (нанести на контурну карту гори Гімала, Джомолунгма,Еверест, Альпи, Монблан, Анд, Карпатська Говерла, Кримські гори)'
	},
	'2023-12-15': {
		'uklen': '||1. К/р',
		'mat': '||1. К/р',
		'mat': '||1. К/р',
		'eng': '||1. К/р',
		'nat': '||1. К/р',
		'tec': '||1. !!!',
		'tec': '||1. '
	},

	'2023-12-18': {
		'etika': '||1. ',
		'zarlit': '||1. Стор. 172-176',
		'uklen': '||1. ',
		'nat': '||1. ',
		'dram': '||1. ',
		'fiz': '||1. Форма'
	},
	'2023-12-19': {
		'pain': '||1. !!!',
		'geog': '||1. К/р',
		'uklen': '||1. Впр. 315',
		'hist': '||1. Індивідуальне завдання Тема: Демократія - загальнолюдська цінність. Давньогрецьке суспільство',
		'mat': '||1. Діаграму у ворді',
		'eng': '||1. Стор. 43, впр.3,4',
		'fiz': '||1. Форма'
	},
	'2023-12-20': {
		'mus': '||1. ',
		'mat': '||1. ',
		'hist': '||1. ',
		'eng': '||1. ',
		'fiz': '||1. Форма',
		'uklit': '||1. ',
		'uklit': '||1. '
	},
	'2023-12-21': {
		'oz': '||',
		'zarlit': '||1. ',
		'prog': '||1. ',
		'mat': '||1. ',
		'uklen': '||1. ',
		'geog': '||1. '
	},
	'2023-12-22': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },

	'2023-12-25': { 'etika': '||1. ', 'zarlit': '||1. ', 'uklen': '||1. ', 'nat': '||1. ', 'dram': '||1. ', 'fiz': '||1. Форма' },
	'2023-12-26': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2023-12-27': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2023-12-28': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'uklen': '||1. ', 'geog': '||1. ' },
	'2023-12-29': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },



	'2024-01-01': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-01-02': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-01-03': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-01-04': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-01-05': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },

	'2024-01-08': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-01-09': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-01-10': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-01-11': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-01-12': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },

	//1
	'2024-01-15': {
		'fiz': '||1. Форма',
		'prog': '||1. Стор. 126 опарцювати/виписати основні судження.|2. Стор. 127 завд.2 за розділом Демо тема: Інструктаж БЖД. Інфографіка. Схеми діаграми. Створення діаграм і схем у різнихпрограмних середовищах|3.Зареєструватись у https://uk.padlet.com/ та створити блог',
		'eng': '||1. P. 45, ex.1,2',
		'nat': '||1. Параг.26, зав. 4',
		'uklen': '||1. Впр. 320',
		'uklen': '||1.'
	},
	'2024-01-16': {
		'pain': '||1. ',
		'geog': '||1. Стор.130, Параг. 26|2. Стор.133, завд. 5,6(усно)',
		'uklen': '||1. Стор. 162 вивчити правила',
		'hist': '||1. Повторити тему уроку за конспектом. Тема: Афінський поліс',
		'mat': '||1. №872, 874',
		'eng': '||1. P.45 ex.2',
		'fiz': '||1. Форма'
	},
	'2024-01-17': {
		'mus': '||!!!2024-01-17 у "Нових знаннях" Д/з немає',
		'mat': '||1. №888, 890',
		'hist': '||1. Параг.31, стор. 144 завд. 2,3',
		'eng': '||1. Стор. 46, впр. 4 (читати виписати назви). Тема: Безпека вдома. Розвиваємо навички читання',
		'fiz': '||1. Форма',
		'uklit': '||1. Дочитати твір "Таємне товариство боягузів"|2. Намалювати хронологічну стрічку пригод головного персонажу',
		'uklit': '||1. '
	},
	'2024-01-18': {
		'oz': '||!!!2024-01-18 у "Нових знаннях" Д/з немає',
		'zarlit': '||1. Стор. 189, завд. 27',
		'prog': '||1. Стор. 128 законспектувати означення|2. Стор.132 впр.1 за розділом Діємо ',
		'mat': '||!!!2024-01-18 у "Нових знаннях" Д/з немає',
		'dram': '||1. Тема: Ляльковий театр. Види театральних ляльок та різнихспособів водіння ляльки (маріонетка, простяна, "петрушка", планшетна лялька тощо)',
		'geog': '||1. Параг.27 стор.134 читати|2. Стор. 137 виконати завдання (письмово малюнок 158)'
	},
	'2024-01-19': {
		'uklen': '||1. Впр. 355',
		'mat': '||1. № 901, 915, 924',
		'mat': '||1. ',
		'eng': '||1. Стор. 37 впр. 1,2,3 (W/B)',
		'nat': '||1. Параг. 25, зробити коробочку для спостереження за сонцем',
		'tec': '||1. ',
		'tec': '||1. '
	},

	//2
	'2024-01-22': {
		'fiz': '||1. Форма',
		'prog': '||1. Стор. 133-135 опрацювати|2. Стор.136 завд.10 за розділом Працюємо розом. Тема: Інструктаж з БЖД. Додавання, редагування та форматування таблиць у текстовому документі та у редакторі презентацій',
		'eng': '||1. Стор. 48, впр. 2(читати), 3(писати). Тема: Безпечна поведінка. Активізація тематичної лексики',
		'nat': '||1. Параг. 25 повторити матеріал',
		'uklen': '||1. Написати міні-твір про тварину',
		'uklen': '||1. '
	},
	'2024-01-23': {
		'pain': '||1. 2024-01-24 у н/з немає д/з',
		'geog': '||1. Стор. 138, параг. 28. Поміркуйте чому великі народні свята припадають на дні сонцестояння та рівнодення',
		'uklen': '||1. 2024-01-24 у н/з немає д/з',
		'hist': '||1. Параг. 33, написати/повторити словник історичних діячів. Тема: практична робота. Історичні портрети Перікла та Олександра великого',
		'mat': '||1. № 930',
		'eng': '||1. Стор.51 впр.5',
		'fiz': '||1. Форма'
	},
	'2024-01-24': {
		'mus': '||1. Виконання "Зима (слова і музика Л.Горової)" Тема: Вокальне і пейзажне мистецтво',
		'mat': '||1. № 944, 955',
		'hist': '||1. Параг. 40-42',
		'eng': '||1. Тема: Одяг і мода. Опрацювання нової тематичної лексики',
		'fiz': '||1. Форма',
		'uklit': '||1. Написати твір-опис тварини (можна домашнього улюбленця) у художньому стилі на основі особистих вражень. Обсяг - сторінка',
		'uklit': '||1. '
	},
	'2024-01-25': {
		'oz': '||1. 2024-01-25 у н/з немає д/з',
		'zarlit': '||1. Стор. 195-205 читати',
		'prog': '||1. Стор. 138-143 опрацювати|2. Стор. 144, завд.6 за розділом Працюємо самотійно',
		'mat': '||1. №958, 962(1,3)',
		'dram': '||1. Тема: Синтез мистецтв у ляльковому театрі. Створення живого персонажа засобами акторского мистецтва',
		'geog': '||1. Стор. 143, параг. 29 читати.|2. Стор. 146 питання 5,6 (письмово)'
	},
	'2024-01-26': {
		'uklen': '||1. ',
		'mat': '||1. №985, 993, 1000',
		'mat': '||1. ',
		'eng': '||1. P.41 ex.1,2,3 (WB)',
		'nat': '||1. Параг. 27 завд.3',
		'tec': '||1. ',
		'tec': '||1. '
	},
	//3
	'2024-01-29': {
		'fiz': '||1. Форма',
		'prog': '||1. Стор. 140, завд 4 за розділом Міркуємо|2. Стор. 147 завд. 9 за розділом Працюємо самотійно. Тема інструктаж з БЖД. Поняття елетронної таблиці. Табличні процеси, їхнє призначення. Середовище табличного процессора. Об/"єкти електронних таблиць-аркуш, клітинка. Введення, редагування даних основних типів. Діапазони клітинок, його виділення',
		'eng': '||1. P.54, ex.7',
		'nat': '||1. Параг. 28-30',
		'uklen': '||1. Впр. 338',
		'uklen': '||1. '
	},
	'2024-01-30': {
		'pain': '||1. Домалювати міський пейзаж і скинути у класрум',
		'geog': '||1. Параг.30 намалювати розу вітрів будь якого міста',
		'uklen': '||1. Самостійна робота',
		'hist': '||1. Зробити практичну',
		'mat': '||1. Д.з. Виконати одну із вправ (або всі за бажанням)|https://www.matific.com/ua/uk/teachers/episodes/Worksheet05DecimalComparison4DecimalDigits|https://learningapps.org/view8907338|https://www.matific.com/ua/uk/teachers/episodes/CardsMultiplicationAsScalingNegativeWholeNumbersUpTo100',
		'eng': '||1. P.56, ex.4',
		'fiz': '||1. Форма'
	},
	'2024-01-31': {
		'mus': 'https://classroom.google.com/c/NTI2OTIxMzY1NjM3/a/NjU4NjI2NzQ3MjQx/details||1. Перегляньте до кінця онлайн презентацію "ВОКАЛЬНЕ МИСТЕЦТВО", прослухайте всі музичні композиції, і проспівайте пісню "Сніг", що є в презентації.',
		'mat': '||1. Тема: Модуль числа. Порівняння раціональних чисел. Самостійна роботаПрацюєте асинхронно.|2. Переглянути відео, пригадати матеріал. |3. Перейти за посиланням і виконати тестові завдання. https://vseosvita.ua/test/start/aid160',
		'hist': '||1. Пройти тести за посиланням https://naurok.ua/student/tests код 9894290',
		'eng': '||1. P.57 ex.2 listening',
		'fiz': '||1. Форма',
		'uklit': '||1. https://classroom.google.com/c/NTQ1MjMzNDAzMDE0/a/NjU4NjU5NDM4NDY5/details||1. Володимир Арєнєв. «Сапієнси» ВИКОТА ТЕСТИ ЗА ПОКЛИКАННЯМ https://vseosvita.ua/test/start/ggy977'
	},
	'2024-02-01': {
		'oz': '||1. 1. Стор.92-96, параг. 16|2. Стор. 96 завд. 4, створити соціальну рекламу і на уроці презентувати її.',
		'zarlit': '||1. ',
		'prog': '||1. ',
		'mat': '||1. ',
		'dram': '||1. ',
		'geog': '||1. '
	},
	'2024-02-02': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//4
	'2024-02-05': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-02-06': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-02-07': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-02-08': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-02-09': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//5
	'2024-02-12': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-02-13': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-02-14': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-02-15': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-02-16': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//6
	'2024-02-19': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-02-20': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-02-21': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-02-22': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-02-23': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//7
	'2024-02-26': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-02-27': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-02-28': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-02-29': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-03-01': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//8
	'2024-03-04': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-03-05': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-03-06': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-03-07': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-03-08': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//9
	'2024-03-11': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-03-12': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-03-13': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-03-14': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-03-15': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//10
	'2024-03-18': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-03-19': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-03-20': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-03-21': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-03-22': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//11
	'2024-03-25': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-03-26': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-03-27': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-03-28': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-03-29': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//0 - Канікули
	'2024-04-01': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-04-02': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-04-03': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-04-04': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-04-05': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//1
	'2024-04-08': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-04-09': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-04-10': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-04-11': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-04-12': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//2
	'2024-04-15': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-04-16': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-04-17': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-04-18': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-04-19': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//3
	'2024-04-22': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-04-23': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-04-24': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-04-25': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-04-26': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//4
	'2024-04-29': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-04-30': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-05-01': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-05-02': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-05-03': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//5
	'2024-05-06': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-05-07': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-05-08': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-05-09': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-05-10': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//6
	'2024-05-13': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-05-14': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-05-15': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-05-16': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-05-17': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//7
	'2024-05-20': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-05-21': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-05-22': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-05-23': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-05-24': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
	//8
	'2024-05-27': { 'fiz': '||1. Форма', 'prog': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'uklen': '||1. ', 'uklen': '||1. ' },
	'2024-05-28': { 'pain': '||1. ', 'geog': '||1. ', 'uklen': '||1. ', 'hist': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма' },
	'2024-05-29': { 'mus': '||1. ', 'mat': '||1. ', 'hist': '||1. ', 'eng': '||1. ', 'fiz': '||1. Форма', 'uklit': '||1. ', 'uklit': '||1. ' },
	'2024-05-30': { 'oz': '||1. ', 'zarlit': '||1. ', 'prog': '||1. ', 'mat': '||1. ', 'dram': '||1. ', 'geog': '||1. ' },
	'2024-05-31': { 'uklen': '||1. ', 'mat': '||1. ', 'mat': '||1. ', 'eng': '||1. ', 'nat': '||1. ', 'tec': '||1. ', 'tec': '||1. ' },
};


function GetHomework() {
	let previosDate = '-';
	for (let keyDate in chHomework) { // отримуємо дату видачі завдання
		for (let keyLesson in chHomework[keyDate]) { // отримуємо назву уроку

			// Отримуємо номер дати попереднього уроку
			let previosI = chLessonDate[keyLesson].chDate.count;
			// Інкремент номеру дати уроку
			chLessonDate[keyLesson].chDate.count++;
			// Отримуємо номер дати цього уроку 
			let nowI = chLessonDate[keyLesson].chDate.count;

			// Присвоюємо номер - даті цього уроку 
			chLessonDate[keyLesson].arI[nowI] = keyDate;

			// Отримуємо дату поперднього уроку  
			previosDate = '-';
			if (previosI > 0) {
				previosDate = chLessonDate[keyLesson].arI[previosI];
			}
			// Присвоюємо даті уроку - попередню дату цього уроку
			chLessonDate[keyLesson].chDate[keyDate] = previosDate;
		}
	}
}

